; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph5 - mode
	image0 - mode
	image6 - mode
	infrared4 - mode
	infrared2 - mode
	infrared3 - mode
	infrared1 - mode
	Star4 - direction
	Star2 - direction
	GroundStation5 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 image6)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 image6)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star2)
	(supports instrument5 image6)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph5)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument8 image0)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 Star3)
	(supports instrument9 image0)
	(calibration_target instrument9 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
)
(:goal (and
	(pointing satellite1 Star2)
	(pointing satellite2 Star2)
	(pointing satellite3 Star11)
	(pointing satellite4 Star3)
	(have_image Planet6 thermograph5)
	(have_image Planet6 image6)
	(have_image Star7 image6)
	(have_image Star7 image0)
	(have_image Star8 infrared2)
	(have_image Star8 image6)
	(have_image Star9 thermograph5)
	(have_image Star9 infrared1)
	(have_image Planet10 image0)
	(have_image Star11 image6)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 14
2. (calibrate satellite4 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 1 of 14
3. (turn_to satellite4 star7 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star7)
   goals met: 1 of 14
4. (take_image satellite4 star7 instrument8 image0)
   added: (have_image star7 image0)
   goals met: 2 of 14
5. (turn_to satellite4 planet10 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 planet10)
   goals met: 2 of 14
6. (take_image satellite4 planet10 instrument8 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 14
7. (turn_to satellite4 star3 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star3)
   goals met: 4 of 14
8. (turn_to satellite2 star2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star2)
   goals met: 5 of 14
9. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   goals met: 5 of 14
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 14
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 14
12. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 5 of 14
13. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 5 of 14
14. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 5 of 14
15. (take_image satellite0 planet6 instrument1 image6)
   added: (have_image planet6 image6)
   goals met: 6 of 14
16. (turn_to satellite0 star11 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star11)
   goals met: 6 of 14
17. (take_image satellite0 star11 instrument1 image6)
   added: (have_image star11 image6)
   goals met: 7 of 14
18. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 7 of 14
19. (take_image satellite0 star7 instrument1 image6)
   added: (have_image star7 image6)
   goals met: 8 of 14
20. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 14
21. (take_image satellite0 star8 instrument1 image6)
   added: (have_image star8 image6)
   goals met: 9 of 14
22. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 14
23. (take_image satellite0 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 10 of 14
24. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   goals met: 10 of 14
25. (take_image satellite1 planet6 instrument3 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 11 of 14
26. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 11 of 14
27. (take_image satellite1 star8 instrument3 infrared2)
   added: (have_image star8 infrared2)
   goals met: 12 of 14
28. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 12 of 14
29. (take_image satellite1 star9 instrument3 thermograph5)
   added: (have_image star9 thermograph5)
   goals met: 13 of 14
30. (turn_to satellite1 star2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star2)
   goals met: 14 of 14
